Update planning.md
